In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('80', 'Tegan', 'Levine', 'F', 'paid'),
 ('97', 'Kate', 'Harrell', 'F', 'paid'),
 ('97', 'Kate', 'Harrell', 'F', 'paid'),
 ('80', 'Tegan', 'Levine', 'F', 'paid'),
 ('97', 'Kate', 'Harrell', 'F', 'paid')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOFSOCN12A8C143F5D', 'Face the Ashes', 'ARXR32B1187FB57099', 2007, Decimal('209.60608'))]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('ARXR32B1187FB57099', 'Gob', '', Decimal('NaN'), Decimal('NaN'))]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 21, 0, 57, 58, 796000), 0, 21, 47, 11, 2018, 2),
 (datetime.datetime(2018, 11, 21, 0, 58, 41, 796000), 0, 21, 47, 11, 2018, 2),
 (datetime.datetime(2018, 11, 21, 1, 2, 5, 796000), 1, 21, 47, 11, 2018, 2),
 (datetime.datetime(2018, 11, 21, 1, 3, 13, 796000), 1, 21, 47, 11, 2018, 2),
 (datetime.datetime(2018, 11, 21, 1, 5, 29, 796000), 1, 21, 47, 11, 2018, 2)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).